Revit 2027 API
SpatialElementBoundaryLocation Enumeration
 An enumerated type listing boundary options of spatial element geometry calculation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SpatialElementBoundaryLocation
Public Enumeration SpatialElementBoundaryLocation
public enum class SpatialElementBoundaryLocation
type SpatialElementBoundaryLocation
Members
Member name | Value | Description
Center | 1 |  Spatial element centerline.
CoreBoundary | 2 |  Spatial element core boundary.
CoreCenter | 3 |  Spatial element core center.
Finish | 0 |  Spatial element finish face.
See Also
Reference
Autodesk.Revit.DB Namespace